Revit 2027 API
ViewSheetSetting.InSession Property
The in-session view sheet set of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InSessionViewSheetSet InSession { get; }
Public ReadOnly Property InSession As InSessionViewSheetSet
	Get
public:
property InSessionViewSheetSet^ InSession {
	InSessionViewSheetSet^ get ();
}
member InSession : InSessionViewSheetSet with get
Property Value
InSessionViewSheetSet
See Also
Reference
ViewSheetSetting Class
Autodesk.Revit.DB Namespace